Tekla Open API Reference for Tekla Structures 2025
ReferenceModelObjectAttribute Class
 The ReferenceModelObjectAttribute class is a base class from where concrete attributes are derived from. The documentation about different attributes and their function can be found from the vendor specification, for example from the IFC format specification.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 More...
 Namespace: Tekla.Structures.Model.Collaboration
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ReferenceModelObjectAttribute
<SerializableAttribute>
Public MustInherit Class ReferenceModelObjectAttribute
The ReferenceModelObjectAttribute type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
Extrusion
 The extrusion vector.
Name
 The name of the product.
ObjectType
 The object type of the product.
Origin
 The origin of the extrusion.
ProfileName
 The name of the profile (often empty).
xDir
 The X-axis direction.
Top
See Also
Reference
Tekla.Structures.Model.Collaboration Namespace
Inheritance Hierarchy
System.Object
 Tekla.Structures.Model.Collaboration.ReferenceModelObjectAttribute
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleHollowProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CircleProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_CShapeProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_EllipseProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_IShapeProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleHollowProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_RectangleProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_TShapeProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile
 Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_ZShapeProfile
 Tekla.Structures.Model.Collaboration.ParametricObject_CustomProfile
 Tekla.Structures.Model.Collaboration.ParametricObject_ObjectBoundingBox